package Pra;

/*---------------------------------
while文を使用して、6の目がでるまでサイコロをふり続けるプログラムを作成してください。
※1～6までのランダムなint型の値を取得する方法 ： 1 + (int)(Math.random() * 6.0)
※6の目が出たら「6が出たので終了します」と表示してください
----------------------------------------------------*/
class Add3 {
	public static void main (String[] args) {
		
		int dice = 0 ;        //サイコロの目（初期値：0）
		
		//サイコロを振る（1～6までのランダムな値を格納）
		
		
		//サイコロの目を表示
		 
		
		//--------------------------------
		//6の目がでるまでサイコロをふり続ける
		//--------------------------------
		while(  ){
			
			//サイコロを振る（1～6までのランダムな値を格納）
			
			
			//サイコロの目を表示
			
			
		}
		
		//終了メッセージを表示
		System.out.println("「6が出たので終了します」") ;
		
	}
}
