package Pra;


public class Pra10 {

	/*
	 * 配列に{20,30,70,10,50,40}を設定し、
	 * この中から最小値と最大値を出力するプログラムを作成してください。
	 */
	public static void main(String[] args) {
		// 配列{20,30,70,10,50,40}を設定
		int[] hairetu = { 20, 30, 70, 10, 50, 40 };
		// 最大値を入れる変数
		int maxSuti;
		// 最小値を入れる変数
		int miniSuti;

		// 配列の数だけ数値を取り出してループ処理を行う
		for () { // 配列をループ + 中身を取り出す処理
			// 最大値より取り出した数値が大きければ置き換える
			if () { // ★配列から取り出した値と現時点での最大値を比較する
				// ★置き換える
			}
			// 最小値より取り出した数値が小さければ置き換える
			if () { // ★配列から取り出した値と現時点での最小値を比較する
				// ★置き換える
			}
		}
		System.out.println("最大値は：" + maxSuti);
		System.out.println("最小値は：" + miniSuti);
	}
}
